## Loading the DataSet ##

Question 1: Given some sample data, write a program to answer the following: click here to access the required data set

On Shopify, we have exactly 100 sneaker shops, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $3145.13. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis.

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('shopifySheet1.csv')
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11


 ## A.) Think about what could be going wrong with our calculation. Think about a better way to evaluate this data.

In [6]:
print(df.total_items)

0       2
1       1
2       1
3       1
4       1
       ..
4995    2
4996    2
4997    3
4998    2
4999    2
Name: total_items, Length: 5000, dtype: int64

In [14]:
items_sale = df['total_items'].sum()
print (items_sale)

43936

In [15]:
total_order_amount = df['order_amount'].sum()
print (total_order_amount)

15725640

In [35]:
aov = total_order_amount / items_sale
print (aov)

357.92152221412965

In [37]:
df.describe()

          order_id      shop_id      user_id   order_amount  total_items
count  5000.000000  5000.000000  5000.000000    5000.000000   5000.00000
mean   2500.500000    50.078800   849.092400    3145.128000      8.78720
std    1443.520003    29.006118    87.798982   41282.539349    116.32032
min       1.000000     1.000000   607.000000      90.000000      1.00000
25%    1250.750000    24.000000   775.000000     163.000000      1.00000
50%    2500.500000    50.000000   849.000000     284.000000      2.00000
75%    3750.250000    75.000000   925.000000     390.000000      3.00000
max    5000.000000   100.000000   999.000000  704000.000000   2000.00000

In [46]:
aov = total_order_amount / items_sale
print (aov)

357.92152221412965